import pandas as pd

# dictionary
data1 = {
        "2015": [9904312, 3448737, 2890451, 2466052], # 열은 같은 데이터 타입
        "2010": [9631482, 3393191, 2632035, 2431774],
        "2005": [9762546, 3512547, 2517680, 2456016],
        "2000": [9853972, 3655437, 2466338, 2473990],
        }

column1 = ["2015","2010","2005","2000"]
index1 = ["서울","부산","인천","대구"]
# DataFrame 생성방법
df1 = pd.DataFrame(data1, index=index1, columns=column1)

data2 = {
        "2015": [9904312, 3448737, 2890451, 2466052], # 열은 같은 데이터 타입
        "2010": [9631482, 3393191, 2632035, 2431774],
        "2005": [9762546, 3512547, 2517680, 2456016],
        "2000": [9853972, 3655437, 2466338, 2473990],
        }

column2 = ["2015","2010","2005","2000"]
index2 = ["서울","부산","인천","대전"]
# DataFrame 생성방법
df2 = pd.DataFrame(data2, index=index2, columns=column2)
# 인덱스의 이름 부여 
df1.index.name = "지역"
df2.index.name = "지역"
# 인덱스를 컬럼으로 사용
df1 = df1.reset_index()
df2 = df2.reset_index()
print(df1)
print(df2)
print("===================================")
# merge
# 2개의 데이터를 결합
print(df1.merge(df2))
print("===================================")
# outer
print(df1.merge(df2, how='outer'))

# 더할경우
print(df1+df2)





